# language: ru

@all
Функция: Добавление продукта в список товаров


  @all
  Сценарий: Успешное добавление продукта в список товаров - сценарий 1
    * выполнено нажатие на "Песочница"
    * выполнено нажатие на "Товары"
    * выполнено нажатие на "Добавить"
    * поле "Наименование" заполняется значением "Манго"
    * выполнен выбор значения "Фрукт" из выпадающего списка "Тип"
    * выполнено нажатие на чек-бокс "Экзотический"
    * выполнено нажатие на "Сохранить"
    * проверено количество количество товаров в списке
#    * проверено добавление введенного "Манго"
    * выполнено нажатие на "Песочница"
    * выполнено нажатие на "Сброс данных"
#    * проверено удаление добавленного "Яблоко"


  @all
  Сценарий: Успешное добавление продукта в список товаров - сценарий 2
    * выполнено нажатие на "Песочница"
    * выполнено нажатие на "Товары"
    * выполнено нажатие на "Добавить"
    * поле "Наименование" заполняется значением "Груша"
    * выполнен выбор значения "Фрукт" из выпадающего списка "Тип"
    * выполнено нажатие на "Сохранить"
    * проверено количество количество товаров в списке
#    * проверено добавление введенного "Груша"
    * выполнено нажатие на "Песочница"
    * выполнено нажатие на "Сброс данных"
#    * проверено удаление добавленного "Яблоко"

  @all
  Сценарий: Успешное добавление продукта в список товаров - сценарий 3
    * выполнено нажатие на "Песочница"
    * выполнено нажатие на "Товары"
    * выполнено нажатие на "Добавить"
    * поле "Наименование" заполняется значением "Кивано"
    * выполнен выбор значения "Овощ" из выпадающего списка "Тип"
    * выполнено нажатие на чек-бокс "Экзотический"
    * выполнено нажатие на "Сохранить"
    * проверено количество количество товаров в списке
#    * проверено добавление введенного "Кивано"
    * выполнено нажатие на "Песочница"
    * выполнено нажатие на "Сброс данных"
#    * проверено удаление добавленного "Яблоко"

  @all
  Сценарий: Успешное добавление продукта в список товаров - сценарий 4
    * выполнено нажатие на "Песочница"
    * выполнено нажатие на "Товары"
    * выполнено нажатие на "Добавить"
    * поле "Наименование" заполняется значением "Картофель"
    * выполнен выбор значения "Овощ" из выпадающего списка "Тип"
    * выполнено нажатие на "Сохранить"
    * проверено количество количество товаров в списке
#    * проверено добавление введенного "Картофель"
    * выполнено нажатие на "Песочница"
    * выполнено нажатие на "Сброс данных"
#    * проверено удаление добавленного "Яблоко"
