# language: ru

@all
Функция: Добавление продукта в список товаров


  @all
  Сценарий: Успешное добавление продукта в список товаров - сценарий 1
    * выполнено нажатие на "Песочница"
    * выполнено нажатие на "Товары"
    * выполнено нажатие на "Добавить"
#    * поле "Наименование" заполняется значением "Манго"
#    * выполнен выбор значения "Фрукт" из выпадающего списка "Тип"
#    * выполнено нажатие на чек-бокс "Экзотический"
#    * выполнено нажатие на "Сохранить"
#    * проверено количество количество товаров в списке
#    * проверено добавление введенного "5 Манго Фрукт true"
#    * выполнено нажатие на "Песочница"
#    * выполнено нажатие на "Сброс данных"
#    * проверено удаление добавленного "4 Яблоко Фрукт false"
#
#
#  @all
#  Сценарий: Успешное добавление продукта в список товаров - сценарий 2
#    * выполнено нажатие на "Песочница"
#    * выполнено нажатие на "Товары"
#    * выполнено нажатие на "Добавить"
#    * поле "Наименование" заполняется значением "Груша"
#    * выполнен выбор значения "Фрукт" из выпадающего списка "Тип"
#    * выполнено нажатие на "Сохранить"
#    * проверено количество количество товаров в списке
#    * проверено добавление введенного "5 Груша Фрукт false"
#    * выполнено нажатие на "Песочница"
#    * выполнено нажатие на "Сброс данных"
#    * проверено удаление добавленного "4 Яблоко Фрукт false"
#
#  @all
#  Сценарий: Успешное добавление продукта в список товаров - сценарий 3
#    * выполнено нажатие на "Песочница"
#    * выполнено нажатие на "Товары"
#    * выполнено нажатие на "Добавить"
#    * поле "Наименование" заполняется значением "Кивано"
#    * выполнен выбор значения "Овощ" из выпадающего списка "Тип"
#    * выполнено нажатие на чек-бокс "Экзотический"
#    * выполнено нажатие на "Сохранить"
#    * проверено количество количество товаров в списке
#    * проверено добавление введенного "5 Кивано Овощ true"
#    * выполнено нажатие на "Песочница"
#    * выполнено нажатие на "Сброс данных"
#    * проверено удаление добавленного "4 Яблоко Фрукт false"
#
#  @all
#  Сценарий: Успешное добавление продукта в список товаров - сценарий 4
#    * выполнено нажатие на "Песочница"
#    * выполнено нажатие на "Товары"
#    * выполнено нажатие на "Добавить"
#    * поле "Наименование" заполняется значением "Картофель"
#    * выполнен выбор значения "Овощ" из выпадающего списка "Тип"
#    * выполнено нажатие на "Сохранить"
#    * проверено количество количество товаров в списке
#    * проверено добавление введенного "5 Картофель Овощ false"
#    * выполнено нажатие на "Песочница"
#    * выполнено нажатие на "Сброс данных"
#    * проверено удаление добавленного "4 Яблоко Фрукт false"
